EDT/MPCurier/src/Documents/УстановкаСтатусаЗаказаЭкипаж/УстановкаСтатусаЗаказаЭкипаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусаЗаказаЭкипаж</name>
  <registerRecords>InformationRegister.СтатусыЗаказов</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереносаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодъема</name>
    <type>
      <types>EnumRef.ВидыПодъемовЗаказаНаЭтаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтажПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БылаПроизведенаПримерка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоSKUПримерки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

EDT/MPCurier/src/InformationRegisters/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/MPCurier/src/Documents/УстановкаСтатусаЗаказаЭкипаж/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СтатусыЗаказов
	Движения.СтатусыЗаказов.Записывать = Истина;	
	Движение = Движения.СтатусыЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Рейс = Рейс;
	Движение.РезультатДоставки = РезультатДоставки;
	Движение.ПричинаОтказаПереноса = ПричинаОтказаПереноса;
	Движение.ДатаПереносаДоставки = ДатаПереносаДоставки;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ	
КонецПроцедуры
#КонецОбласти
